export default {
  projections: {
    СерверE: {
      протокол: {
        __caption__: 'Протокол'
      },
      iP: {
        __caption__: 'IP'
      },
      порт: {
        __caption__: 'Порт'
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        имя: {
          __caption__: 'Имя'
        }
      },
      настройки: {
        __caption__: 'Настройки',
        типНастроек: {
          __caption__: 'Тип настроек'
        },
        датаНачала: {
          __caption__: 'Дата начала'
        },
        датаОкончания: {
          __caption__: 'Дата окончания'
        },
        описаний: {
          __caption__: 'Описаний'
        }
      },
      программы: {
        __caption__: 'Программы',
        название: {
          __caption__: 'Название'
        },
        описание: {
          __caption__: 'Описание'
        },
        версия: {
          __caption__: 'Версия'
        },
        размер: {
          __caption__: 'Размер'
        },
        едИзмерения: {
          __caption__: 'Ед измерения'
        }
      }
    },
    СерверL: {
      протокол: {
        __caption__: 'Протокол'
      },
      iP: {
        __caption__: 'IP'
      },
      порт: {
        __caption__: 'Порт'
      },
      сотрудник: {
        __caption__: 'Имя',
        имя: {
          __caption__: 'Имя'
        }
      }
    }
  },
  validations: {
    iP: {
      __caption__: 'IP'
    },
    порт: {
      __caption__: 'Порт'
    },
    протокол: {
      __caption__: 'Протокол'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    },
    настройки: {
      __caption__: 'Настройки'
    },
    программы: {
      __caption__: 'Программы'
    }
  }
};
